In [1]:
import sys
sys.path.append("../src")

import pandas as pd
from data_cleaning import clean_salary_data, check_missing_duplicates

In [2]:
df = pd.read_csv("../data/raw_data/salaries.csv")

In [3]:
df.info

<bound method DataFrame.info of        work_year experience_level employment_type                 job_title  \
0           2025               MI              FT  Customer Success Manager
1           2025               SE              FT                  Engineer
2           2025               SE              FT                  Engineer
3           2025               SE              FT         Applied Scientist
4           2025               SE              FT         Applied Scientist
...          ...              ...             ...                       ...
88579       2020               SE              FT            Data Scientist
88580       2021               MI              FT  Principal Data Scientist
88581       2020               EN              FT            Data Scientist
88582       2020               EN              CT     Business Data Analyst
88583       2021               SE              FT            Data Scientist

        salary salary_currency  salary_in_usd employee_residence  \
0        57000             EUR          60000                 NL
1       165000             USD         165000                 US
2       109000             USD         109000                 US
3       294000             USD         294000                 US
4       137600             USD         137600                 US
...        ...             ...            ...                ...
88579   412000             USD         412000                 US
88580   151000             USD         151000                 US
88581   105000             USD         105000                 US
88582   100000             USD         100000                 US
88583  7000000             INR          94665                 IN

       remote_ratio company_location company_size
0                50               NL            L
1                 0               US            M
2                 0               US            M
3                 0               US            M
4                 0               US            M
...             ...              ...          ...
88579           100               US            L
88580           100               US            L
88581           100               US            S
88582           100               US            L
88583            50               IN            L

[88584 rows x 11 columns]>

In [4]:
print(df.head())

   work_year experience_level employment_type                 job_title  \
0       2025               MI              FT  Customer Success Manager
1       2025               SE              FT                  Engineer
2       2025               SE              FT                  Engineer
3       2025               SE              FT         Applied Scientist
4       2025               SE              FT         Applied Scientist

   salary salary_currency  salary_in_usd employee_residence  remote_ratio  \
0   57000             EUR          60000                 NL            50
1  165000             USD         165000                 US             0
2  109000             USD         109000                 US             0
3  294000             USD         294000                 US             0
4  137600             USD         137600                 US             0

  company_location company_size
0               NL            L
1               US            M
2               US            M
3               US            M
4               US            M

In [5]:
check_missing_duplicates(df)

Missing values:
 work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

Duplicate rows: 44340

In [6]:
df_cleaned = clean_salary_data(df)

In [7]:
check_missing_duplicates(df_cleaned)

Missing values:
 work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

Duplicate rows: 0

In [8]:
df_cleaned.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,MI,FT,Customer Success Manager,57000,EUR,60000,NL,50,NL,L
1,2025,SE,FT,Engineer,165000,USD,165000,US,0,US,M
2,2025,SE,FT,Engineer,109000,USD,109000,US,0,US,M
3,2025,SE,FT,Applied Scientist,294000,USD,294000,US,0,US,M
4,2025,SE,FT,Applied Scientist,137600,USD,137600,US,0,US,M

In [9]:
df_cleaned.describe()

          work_year        salary  salary_in_usd  remote_ratio
count  44244.000000  4.424400e+04   44244.000000  44244.000000
mean    2024.065952  1.599579e+05  151313.435788     24.941235
std        0.713820  2.673229e+05   77343.097878     43.075374
min     2020.000000  1.400000e+04   15000.000000      0.000000
25%     2024.000000  9.620000e+04   96200.000000      0.000000
50%     2024.000000  1.400000e+05  139200.000000      0.000000
75%     2024.000000  1.920000e+05  190315.000000     50.000000
max     2025.000000  3.040000e+07  800000.000000    100.000000

In [10]:
df_cleaned.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [11]:
df_cleaned.duplicated().sum()

np.int64(0)

In [12]:
df_cleaned['job_title'].value_counts()

job_title
Data Scientist               5207
Data Engineer                4916
Data Analyst                 4355
Software Engineer            3009
Machine Learning Engineer    2583
                             ...
Sales Data Analyst              1
Data Science Tech Lead          1
Marketing Data Engineer         1
Principal Data Architect        1
Cloud Data Architect            1
Name: count, Length: 312, dtype: int64

In [13]:
df_cleaned['company_location'].value_counts().head(10)

company_location
US    37445
CA     2461
GB     1820
AU      269
DE      239
FR      181
LT      171
NL      168
ES      132
IN      119
Name: count, dtype: int64

In [14]:
df_cleaned['salary_in_usd'].value_counts()

salary_in_usd
100000    453
150000    396
120000    387
130000    328
160000    318
         ...
116914      1
46597       1
41689       1
114047      1
94665       1
Name: count, Length: 9164, dtype: int64

In [20]:
df_cleaned.to_csv('../data/clean_data/cleaned_salary.csv', index=False)